
package Day01;
public class Ex1 { // class s 
	
	int 변수 = 10; // 코드 작성 가능
	// 2. 실행되는 코드는 main함수{} 안에서만 코드 작성한다. !
		// main함수 : 메인스레드 가지고 있는 함수
		// 스레드 : 코드를 읽는 흐름 단위
	
	
		// m + ctrl + 스페이스바 + 엔터	
	public static void main(String[] args) {
		System.out.println("안녕 자바");
	}
	
} // class e


/*
	package : 패키지 이름이 표시되는 키워드 
	package 패키지명; : 현재 소스파일이 위치한 패키지명

*/


/*
 	public	: 사용범위뜻 [ 프로젝트 내 모든 곳 사용 ] 
    class	: 클래스 선언 사용되는 키워드
   	Ex1		: 클래스명[아무거나]
    { }		: 클래스의 시작s 끝e	
 */  



/*
	실제 존재하는 모든 것 --------> 코드
	공기, 돈, 사람 등			객체지향 언어
	[ 성질, 행동 ]				성질, 행동
	
		예1)	붕어빵 틀
			반죽[성질, 속성]		붕어빵1 [ 밀가루 , 팥 ]
			굽기[행동				붕어빵2 [ 밀가루 , 팥 ]
								붕어빵3 [ 밀가루 , 슈크림 ]
								- 붕어빵은 서로 다 다르다.
		
		예2)	SM7 자동차 틀	
		 	속도 [성질, 속성]  		SM7 자동차1[ 50 , 주행중 ]
			주체 [행동] 			SM7 자동차2[ 0 , 주행X ]
		
		
		예3) 객체지향 프로그래밍
			
			타이어 틀 : 금호타이어 회사
				공기압			--> 타이어1 객체 / 타이어2 객체
				구르기
							
			자동차 틀 [ 클래스 ] : 현대 회사
				타이어 [ 금호타이어 객체 ]
		
	자바 100% 객체지향언어
		클래스 			: 객체 생성하기 위한 미리 정의된 틀/설계도
		객체 				: 클래스 기반으로 만들어진 식별가능한 형태/메모리
   		객체지향[ OOP ] 	: 객체들을 모아서 만든 프로그램 (ex) 레고
   
*/












